Experiencia presencial 2/actividad/app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "holaaaaaa\r\n"], ["user_id", 1], ["post_id", 1], ["created_at", "2018-08-01 23:56:33.415360"], ["updated_at", "2018-08-01 23:56:33.415360"]]
---
	def create
		@post = Post.find(params[:post_id])
		@comment = Comment.new(content:params[:comment][:content], user: current_user)
		authorize! :create, @commet
		@post.comments << @comment

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 83], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 83]]
---
	def destroy

		@post = Post.find(params[:post_id])
		@comment = Comment.find(params[:id])

		@comment.destroy