Experiencia presencial 2/actividad/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hola "], ["content", "com estas"], ["user_id", 1], ["created_at", "2018-08-01 23:56:27.401987"], ["updated_at", "2018-08-01 23:56:27.401987"]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save