Experiencia presencial 2/actividad/app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
        <td><%= post.user.name %></td>
        <td><%= post.comments.count %></td>